{"keras_version": "2.0.9", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "activity_regularizer": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "recurrent_regularizer": null, "dropout": 0.0, "trainable": true, "units": 20, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "unroll": false, "use_bias": true, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "stateful": false, "return_sequences": false, "batch_input_shape": [null, 14, 1], "activation": "tanh", "recurrent_dropout": 0.0, "unit_forget_bias": true, "implementation": 1, "kernel_constraint": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "activation": "sigmoid", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}}], "backend": "tensorflow"}