{"config": [{"class_name": "Embedding", "config": {"name": "embedding_1", "dtype": "float32", "activity_regularizer": null, "batch_input_shape": [null, 14], "output_dim": 4, "input_dim": 4, "mask_zero": false, "trainable": false, "input_length": 14, "embeddings_regularizer": null, "embeddings_constraint": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "kernel_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "stateful": false, "units": 32, "recurrent_dropout": 0.0, "go_backwards": false, "bias_regularizer": null, "implementation": 1, "return_state": false, "return_sequences": true, "trainable": true, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "kernel_constraint": null, "use_bias": true, "recurrent_regularizer": null, "bias_constraint": null}}}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_2", "trainable": true, "merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"name": "lstm_2", "kernel_regularizer": null, "dropout": 0.0, "activity_regularizer": null, "stateful": false, "units": 32, "recurrent_dropout": 0.0, "go_backwards": false, "bias_regularizer": null, "implementation": 1, "return_state": false, "return_sequences": false, "trainable": true, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "kernel_constraint": null, "use_bias": true, "recurrent_regularizer": null, "bias_constraint": null}}}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_regularizer": null, "activation": "sigmoid", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "units": 1, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.9"}